---
kind: method
id: M:Autodesk.Revit.DB.Architecture.NonContinuousRailStructure.GetNonContinuousRailCount
source: html/42c5db6c-e5f8-f7ea-a150-f5f3cfcb40aa.htm
---
# Autodesk.Revit.DB.Architecture.NonContinuousRailStructure.GetNonContinuousRailCount Method

Gets number of Non-Continuous Rails.

## Syntax (C#)
```csharp
public int GetNonContinuousRailCount()
```

## Returns
Count of Non-Continuous Rails.